app/controllers/account_controller.rb

INSERT INTO `users` (`salt`, `created_at`, `updated_at`, `country`, `project_id`, `is_admin`, `state`, `login`, `name`, `email`, `crypted_password`, `remember_token`, `data_entry_only`, `remember_token_expires_at`) VALUES('a25e6f0bbb6157b0ac7110b7230906453bb7f614', '2013-10-06 14:40:11', '2013-10-06 14:40:11', NULL, 66, 0, NULL, 'test22', 'test22', 'sales@burrett.org', 'ce68a9b0fa7df11f53e6105fedba24c655cc035e', NULL, 1, NULL)
---
  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.project_id = PROJECT_NUMBER
    @user.data_entry_only = true
    @user.save!