app/controllers/samples_controller.rb

 def index
    @batch_import = false
    if current_user.login == "admin"
      @sample = Sample.find(:all, :order => 'date_collected' , :include => [:genders, :dna_results, :mt_dnas], :conditions => "project_id = #{PROJECT_NUMBER} and remote_data_entry = true")
---
SELECT * FROM `samples` WHERE (project_id = 66 and remote_data_entry = true and user_id = '68') ORDER BY date_collected
SELECT `dna_results`.* FROM `dna_results` WHERE (`dna_results`.sample_id IN (183855,183874,183875,183876,183877,183879,183881,183883,183882))
SELECT `genders`.* FROM `genders` WHERE (`genders`.sample_id IN (183855,183874,183875,183876,183877,183879,183881,183883,183882))
SELECT `mt_dnas`.* FROM `mt_dnas` WHERE (`mt_dnas`.sample_id IN (183855,183874,183875,183876,183877,183879,183881,183883,183882))

  def show
    @sample = Sample.find(params[:id],:include => [:genders, :dna_results, :mt_dnas])
    @sfw = 100
    @org = Organization.find_by_id(@sample.organization_id)
---
SELECT * FROM `samples` WHERE (`samples`.`id` = 183882)
SELECT `dna_results`.* FROM `dna_results` WHERE (`dna_results`.sample_id = 183882)
SELECT `genders`.* FROM `genders` WHERE (`genders`.sample_id = 183882)
SELECT `mt_dnas`.* FROM `mt_dnas` WHERE (`mt_dnas`.sample_id = 183882)
SELECT * FROM `organizations` WHERE (`organizations`.`id` IS NULL) LIMIT 1

  def edit
    @sample = Sample.find(params[:id])
---
SELECT * FROM `samples` WHERE (`samples`.`id` = 183882)

  def update
    @sample = Sample.find(params[:id])
    respond_to do |format|
      if @sample.update_attributes(params[:sample])
---
SELECT * FROM `samples` WHERE (`samples`.`id` = 183882)
UPDATE `samples` SET `comments` = '2', `chicken_declared_gender` = 'Female', `collector_comments` = 'Commercial', `chicken_feathering` = 'Fast Feather', `collected_by` = '1', `chicken_country` = 'Canada', `chicken_meat_part` = 'Boneless, Skinless Breast', `chicken_ml_duplicate` = 'Yes', `submitter_comments` = 'Bovain' WHERE `id` = 183882